rgregg/esp32-wireless-thermostat/src/main.cpp
String ctrl_topic_for(const char *suffix) {
  String out(g_cfg_ctrl_mqtt_base_topic);
  out += "/";
  out += suffix;
  return out;
}

String display_topic_for(const char *suffix) {
  String out(g_cfg_display_mqtt_base_topic);
  out += "/";
  out += suffix;
  return out;
}

void ctrl_set_display_cfg_cache(const String &key, const String &value) {
  for (size_t i = 0; i < (sizeof(g_disp_cfg_cache) / sizeof(g_disp_cfg_cache[0])); ++i) {
    if (key == g_disp_cfg_cache[i].key) {
      g_disp_cfg_cache[i].value = value;
      return;
    }
  }
}

String ctrl_get_display_cfg_cache(const char *key) {
  for (size_t i = 0; i < (sizeof(g_disp_cfg_cache) / sizeof(g_disp_cfg_cache[0])); ++i) {
    if (strcmp(key, g_disp_cfg_cache[i].key) == 0) {
      return g_disp_cfg_cache[i].value;
    }
  }
  return "unknown";
}

bool ctrl_publish_display_cfg_set(const String &key, const String &value) {
  if (!g_ctrl_mqtt.connected()) {
    return false;
  }
  String topic = display_topic_for("cfg");
  topic += "/";
  topic += key;
  topic += "/set";
  return g_ctrl_mqtt.publish(topic.c_str(), value.c_str(), true);
}

void ctrl_publish_cfg_value(const char *key, const String &value, bool redact) {
  if (!g_ctrl_mqtt.connected()) {
    return;
  }
  String topic = ctrl_topic_for("cfg");
  topic += "/";
  topic += key;
  topic += "/state";
  const char *payload = value.c_str();
  if (redact) {
    payload = value.length() > 0 ? "set" : "unset";
  }
  g_ctrl_mqtt.publish(topic.c_str(), payload, true);
}

void ctrl_publish_all_cfg_state() {
  ctrl_publish_cfg_value("wifi_ssid", g_cfg_ctrl_wifi_ssid, false);
  ctrl_publish_cfg_value("wifi_password", g_cfg_ctrl_wifi_password, true);
  ctrl_publish_cfg_value("mqtt_host", g_cfg_ctrl_mqtt_host, false);
  ctrl_publish_cfg_value("mqtt_port", String(g_cfg_ctrl_mqtt_port), false);
  ctrl_publish_cfg_value("mqtt_user", g_cfg_ctrl_mqtt_user, false);
  ctrl_publish_cfg_value("mqtt_password", g_cfg_ctrl_mqtt_password, true);
  ctrl_publish_cfg_value("mqtt_client_id", g_cfg_ctrl_mqtt_client_id, false);
  ctrl_publish_cfg_value("mqtt_base_topic", g_cfg_ctrl_mqtt_base_topic, false);
  ctrl_publish_cfg_value("display_mqtt_base_topic", g_cfg_display_mqtt_base_topic, false);
  ctrl_publish_cfg_value("shared_device_id", g_cfg_shared_device_id, false);
  ctrl_publish_cfg_value("ota_hostname", g_cfg_ctrl_ota_hostname, false);
  ctrl_publish_cfg_value("ota_password", g_cfg_ctrl_ota_password, true);
  ctrl_publish_cfg_value("espnow_channel", String(g_cfg_ctrl_espnow_channel), false);
  ctrl_publish_cfg_value("espnow_peer_mac", g_cfg_ctrl_espnow_peer_mac, false);
  ctrl_publish_cfg_value("espnow_lmk", g_cfg_ctrl_espnow_lmk, true);
  ctrl_publish_cfg_value("reboot_required", g_ctrl_cfg_reboot_required ? "1" : "0", false);
}

bool ctrl_try_update_runtime_config(const String &key, const char *raw_value) {
  if (!g_ctrl_cfg_ready || raw_value == nullptr) {
    return false;
  }
  const String value(raw_value);
  bool known = true;
  if (key == "wifi_ssid") {
    g_cfg_ctrl_wifi_ssid = value;
    g_ctrl_cfg.putString("wifi_ssid", value);
    g_ctrl_wifi_reconnect_required = true;
  } else if (key == "wifi_password") {
    g_cfg_ctrl_wifi_password = value;
    g_ctrl_cfg.putString("wifi_pwd", value);
    g_ctrl_wifi_reconnect_required = true;
  } else if (key == "mqtt_host") {
    g_cfg_ctrl_mqtt_host = value;
    g_ctrl_cfg.putString("mqtt_host", value);
    g_ctrl_mqtt_reconfigure_required = true;
  } else if (key == "mqtt_port") {
    const long parsed = atol(raw_value);
    if (parsed < 1 || parsed > 65535) {
      return false;
    }
    g_cfg_ctrl_mqtt_port = static_cast<uint16_t>(parsed);
    g_ctrl_cfg.putUInt("mqtt_port", g_cfg_ctrl_mqtt_port);
    g_ctrl_mqtt_reconfigure_required = true;
  } else if (key == "mqtt_user") {
    g_cfg_ctrl_mqtt_user = value;
    g_ctrl_cfg.putString("mqtt_user", value);
    g_ctrl_mqtt_reconfigure_required = true;
  } else if (key == "mqtt_password") {
    g_cfg_ctrl_mqtt_password = value;
    g_ctrl_cfg.putString("mqtt_pwd", value);
    g_ctrl_mqtt_reconfigure_required = true;
  } else if (key == "mqtt_client_id") {
    g_cfg_ctrl_mqtt_client_id = value;
    g_ctrl_cfg.putString("mqtt_cid", value);
    g_ctrl_mqtt_reconfigure_required = true;
  } else if (key == "mqtt_base_topic") {
    g_cfg_ctrl_mqtt_base_topic = value;
    g_ctrl_cfg.putString("mqtt_base", value);
    g_ctrl_mqtt_reconfigure_required = true;
    g_ctrl_mqtt_discovery_sent = false;
  } else if (key == "display_mqtt_base_topic") {
    g_cfg_display_mqtt_base_topic = value;
    g_ctrl_cfg.putString("disp_base", value);
    g_ctrl_mqtt_reconfigure_required = true;
  } else if (key == "shared_device_id") {
    g_cfg_shared_device_id = value;
    g_ctrl_cfg.putString("shared_id", value);
    g_ctrl_mqtt_discovery_sent = false;
  } else if (key == "ota_hostname") {
    g_cfg_ctrl_ota_hostname = value;
    g_ctrl_cfg.putString("ota_host", value);
  } else if (key == "ota_password") {
    g_cfg_ctrl_ota_password = value;
    g_ctrl_cfg.putString("ota_pwd", value);
  } else if (key == "espnow_channel") {
    const long parsed = atol(raw_value);
    if (parsed < 1 || parsed > 14) {
      return false;
    }
    g_cfg_ctrl_espnow_channel = static_cast<uint8_t>(parsed);
    g_ctrl_cfg.putUChar("esp_ch", g_cfg_ctrl_espnow_channel);
    g_ctrl_cfg_reboot_required = true;
  } else if (key == "espnow_peer_mac") {
    g_cfg_ctrl_espnow_peer_mac = value;
    g_ctrl_cfg.putString("esp_peer", value);
    g_ctrl_cfg_reboot_required = true;
  } else if (key == "espnow_lmk") {
    g_cfg_ctrl_espnow_lmk = value;
    g_ctrl_cfg.putString("esp_lmk", value);
    g_ctrl_cfg_reboot_required = true;
  } else {
    known = false;
  }

  if (!known) {
    return false;
  }
  if (g_ctrl_mqtt.connected()) {
    ctrl_publish_cfg_value(key.c_str(), value,
                           key == "wifi_password" || key == "mqtt_password" ||
                               key == "ota_password" || key == "espnow_lmk");
  }
  return true;
}

bool ctrl_parse_bool_payload(const char *value) {
  if (value == nullptr) {
    return false;
  }
  return strcmp(value, "1") == 0 || strcmp(value, "true") == 0 || strcmp(value, "on") == 0;
}

bool ctrl_parse_mac(const char *text, uint8_t out[6]) {
  if (text == nullptr || strlen(text) < 17) {
    return false;
  }
  unsigned values[6] = {};
  if (sscanf(text, "%02x:%02x:%02x:%02x:%02x:%02x", &values[0], &values[1], &values[2],
             &values[3], &values[4], &values[5]) != 6) {
    return false;
  }
  for (int i = 0; i < 6; ++i) {
    out[i] = static_cast<uint8_t>(values[i] & 0xFFu);
  }
  return true;
}

bool ctrl_parse_lmk_hex(const char *text, uint8_t out[16]) {
  if (text == nullptr || strlen(text) != 32) {
    return false;
  }
  for (int i = 0; i < 16; ++i) {
    unsigned byte = 0;
    if (sscanf(text + (i * 2), "%02x", &byte) != 1) {
      return false;
    }
    out[i] = static_cast<uint8_t>(byte & 0xFFu);
  }
  return true;
}

void ctrl_publish_discovery() {
  if (!g_ctrl_mqtt.connected() || g_ctrl_mqtt_discovery_sent) {
    return;
  }

  const String base = g_cfg_ctrl_mqtt_base_topic;
  const String dev_id = g_cfg_shared_device_id;
  const String switch_topic = String("homeassistant/switch/") + dev_id + "_lockout/config";
  const String filter_topic = String("homeassistant/sensor/") + dev_id + "_filter_runtime/config";
  const String state_topic = String("homeassistant/sensor/") + dev_id + "_furnace_state/config";

  char payload[768];
  snprintf(payload, sizeof(payload),
           "{\"name\":\"HVAC Lockout\",\"uniq_id\":\"%s_lockout\",\"cmd_t\":\"%s/cmd/lockout\","
           "\"stat_t\":\"%s/state/lockout\",\"pl_on\":\"1\",\"pl_off\":\"0\","
           "\"dev\":{\"ids\":[\"%s\"],\"name\":\"Wireless Thermostat System\","
           "\"mf\":\"rgregg\",\"mdl\":\"ESP32 Thermostat\"}}",
           dev_id.c_str(), base.c_str(), base.c_str(), dev_id.c_str());
  g_ctrl_mqtt.publish(switch_topic.c_str(), payload, true);

  snprintf(payload, sizeof(payload),
           "{\"name\":\"Filter Runtime\",\"uniq_id\":\"%s_filter_runtime\","
           "\"stat_t\":\"%s/state/filter_runtime_hours\",\"unit_of_meas\":\"h\","
           "\"dev_cla\":\"duration\",\"stat_cla\":\"measurement\","
           "\"dev\":{\"ids\":[\"%s\"]}}",
           dev_id.c_str(), base.c_str(), dev_id.c_str());
  g_ctrl_mqtt.publish(filter_topic.c_str(), payload, true);

  snprintf(payload, sizeof(payload),
           "{\"name\":\"Furnace State\",\"uniq_id\":\"%s_furnace_state\","
           "\"stat_t\":\"%s/state/furnace_state\",\"icon\":\"mdi:hvac\","
           "\"dev\":{\"ids\":[\"%s\"]}}",
           dev_id.c_str(), base.c_str(), dev_id.c_str());
  g_ctrl_mqtt.publish(state_topic.c_str(), payload, true);

  g_ctrl_mqtt_discovery_sent = true;
}

String ctrl_json_escape(const String &in) {
  String out;
  out.reserve(in.length() + 8);
  for (size_t i = 0; i < in.length(); ++i) {
    const char c = in[i];
    if (c == '"' || c == '\\') {
      out += '\\';
    }
    out += c;
  }
  return out;
}

void ctrl_web_handle_config_get() {
  String body = "{\"controller\":{";
  body += "\"wifi_ssid\":\"" + ctrl_json_escape(g_cfg_ctrl_wifi_ssid) + "\",";
  body += "\"wifi_password\":\"" + String(g_cfg_ctrl_wifi_password.length() > 0 ? "set" : "unset") + "\",";
  body += "\"mqtt_host\":\"" + ctrl_json_escape(g_cfg_ctrl_mqtt_host) + "\",";
  body += "\"mqtt_port\":" + String(g_cfg_ctrl_mqtt_port) + ",";
  body += "\"mqtt_user\":\"" + ctrl_json_escape(g_cfg_ctrl_mqtt_user) + "\",";
  body += "\"mqtt_password\":\"" + String(g_cfg_ctrl_mqtt_password.length() > 0 ? "set" : "unset") + "\",";
  body += "\"mqtt_client_id\":\"" + ctrl_json_escape(g_cfg_ctrl_mqtt_client_id) + "\",";
  body += "\"mqtt_base_topic\":\"" + ctrl_json_escape(g_cfg_ctrl_mqtt_base_topic) + "\",";
  body += "\"display_mqtt_base_topic\":\"" + ctrl_json_escape(g_cfg_display_mqtt_base_topic) + "\",";
  body += "\"shared_device_id\":\"" + ctrl_json_escape(g_cfg_shared_device_id) + "\",";
  body += "\"ota_hostname\":\"" + ctrl_json_escape(g_cfg_ctrl_ota_hostname) + "\",";
  body += "\"ota_password\":\"" + String(g_cfg_ctrl_ota_password.length() > 0 ? "set" : "unset") + "\",";
  body += "\"espnow_channel\":" + String(g_cfg_ctrl_espnow_channel) + ",";
  body += "\"espnow_peer_mac\":\"" + ctrl_json_escape(g_cfg_ctrl_espnow_peer_mac) + "\",";
  body += "\"espnow_lmk\":\"" + String(g_cfg_ctrl_espnow_lmk.length() > 0 ? "set" : "unset") + "\",";
  body += "\"reboot_required\":" + String(g_ctrl_cfg_reboot_required ? "true" : "false");
  body += "},\"display\":{";
  body += "\"availability\":\"" + ctrl_json_escape(g_disp_availability) + "\",";
  for (size_t i = 0; i < (sizeof(g_disp_cfg_cache) / sizeof(g_disp_cfg_cache[0])); ++i) {
    body += "\"" + String(g_disp_cfg_cache[i].key) + "\":\"" +
            ctrl_json_escape(g_disp_cfg_cache[i].value) + "\"";
    if (i + 1 < (sizeof(g_disp_cfg_cache) / sizeof(g_disp_cfg_cache[0]))) {
      body += ",";
    }
  }
  body += "}}";
  g_ctrl_web.send(200, "application/json", body);
}

