rgregg/esp32-wireless-thermostat/src/main.cpp
void ctrl_web_handle_config_post() {
  int updated_local = 0;
  int updated_display = 0;
  for (int i = 0; i < g_ctrl_web.args(); ++i) {
    const String name = g_ctrl_web.argName(i);
    const String value = g_ctrl_web.arg(i);
    if (name.startsWith("disp_")) {
      const String key = name.substring(5);
      if (ctrl_publish_display_cfg_set(key, value)) {
        ++updated_display;
      }
      continue;
    }
    if (ctrl_try_update_runtime_config(name, value.c_str())) {
      ++updated_local;
    }
  }
  String body = "updated_local=" + String(updated_local) +
                " updated_display=" + String(updated_display) + "\n";
  g_ctrl_web.send(200, "text/plain", body);
}

void ctrl_web_handle_root() {
  String html;
  html.reserve(4096);
  html += "<html><body><h1>System Config (Controller + Display)</h1>";
  html += "<p><a href=\"/config\">JSON config</a></p>";
  html += "<h2>Controller</h2>";
  html += "<form method=\"post\" action=\"/config\">";
  html += "wifi_ssid: <input name=\"wifi_ssid\" value=\"" + g_cfg_ctrl_wifi_ssid + "\"><br>";
  html += "wifi_password: <input name=\"wifi_password\" value=\"\"><br>";
  html += "mqtt_host: <input name=\"mqtt_host\" value=\"" + g_cfg_ctrl_mqtt_host + "\"><br>";
  html += "mqtt_port: <input name=\"mqtt_port\" value=\"" + String(g_cfg_ctrl_mqtt_port) + "\"><br>";
  html += "mqtt_user: <input name=\"mqtt_user\" value=\"" + g_cfg_ctrl_mqtt_user + "\"><br>";
  html += "mqtt_password: <input name=\"mqtt_password\" value=\"\"><br>";
  html += "mqtt_client_id: <input name=\"mqtt_client_id\" value=\"" + g_cfg_ctrl_mqtt_client_id + "\"><br>";
  html += "mqtt_base_topic: <input name=\"mqtt_base_topic\" value=\"" + g_cfg_ctrl_mqtt_base_topic + "\"><br>";
  html += "display_mqtt_base_topic: <input name=\"display_mqtt_base_topic\" value=\"" + g_cfg_display_mqtt_base_topic + "\"><br>";
  html += "shared_device_id: <input name=\"shared_device_id\" value=\"" + g_cfg_shared_device_id + "\"><br>";
  html += "ota_hostname: <input name=\"ota_hostname\" value=\"" + g_cfg_ctrl_ota_hostname + "\"><br>";
  html += "ota_password: <input name=\"ota_password\" value=\"\"><br>";
  html += "espnow_channel: <input name=\"espnow_channel\" value=\"" + String(g_cfg_ctrl_espnow_channel) + "\"><br>";
  html += "espnow_peer_mac: <input name=\"espnow_peer_mac\" value=\"" + g_cfg_ctrl_espnow_peer_mac + "\"><br>";
  html += "espnow_lmk: <input name=\"espnow_lmk\" value=\"\"><br>";
  html += "<button type=\"submit\">Save Controller</button></form>";
  html += "<p>reboot_required=" + String(g_ctrl_cfg_reboot_required ? "true" : "false") + "</p>";

  html += "<h2>Display (via MQTT)</h2>";
  html += "<p>availability=" + g_disp_availability + "</p>";
  html += "<form method=\"post\" action=\"/config\">";
  html += "wifi_ssid: <input name=\"disp_wifi_ssid\" value=\"" + ctrl_get_display_cfg_cache("wifi_ssid") + "\"><br>";
  html += "wifi_password: <input name=\"disp_wifi_password\" value=\"\"><br>";
  html += "mqtt_host: <input name=\"disp_mqtt_host\" value=\"" + ctrl_get_display_cfg_cache("mqtt_host") + "\"><br>";
  html += "mqtt_port: <input name=\"disp_mqtt_port\" value=\"" + ctrl_get_display_cfg_cache("mqtt_port") + "\"><br>";
  html += "mqtt_user: <input name=\"disp_mqtt_user\" value=\"" + ctrl_get_display_cfg_cache("mqtt_user") + "\"><br>";
  html += "mqtt_password: <input name=\"disp_mqtt_password\" value=\"\"><br>";
  html += "mqtt_client_id: <input name=\"disp_mqtt_client_id\" value=\"" + ctrl_get_display_cfg_cache("mqtt_client_id") + "\"><br>";
  html += "mqtt_base_topic: <input name=\"disp_mqtt_base_topic\" value=\"" + ctrl_get_display_cfg_cache("mqtt_base_topic") + "\"><br>";
  html += "discovery_prefix: <input name=\"disp_discovery_prefix\" value=\"" + ctrl_get_display_cfg_cache("discovery_prefix") + "\"><br>";
  html += "shared_device_id: <input name=\"disp_shared_device_id\" value=\"" + ctrl_get_display_cfg_cache("shared_device_id") + "\"><br>";
  html += "display_timeout_s: <input name=\"disp_display_timeout_s\" value=\"" + ctrl_get_display_cfg_cache("display_timeout_s") + "\"><br>";
  html += "temp_comp_c: <input name=\"disp_temp_comp_c\" value=\"" + ctrl_get_display_cfg_cache("temp_comp_c") + "\"><br>";
  html += "temperature_unit: <input name=\"disp_temperature_unit\" value=\"" + ctrl_get_display_cfg_cache("temperature_unit") + "\"><br>";
  html += "outdoor_temp_topic: <input name=\"disp_outdoor_temp_topic\" value=\"" + ctrl_get_display_cfg_cache("outdoor_temp_topic") + "\"><br>";
  html += "weather_condition_topic: <input name=\"disp_weather_condition_topic\" value=\"" + ctrl_get_display_cfg_cache("weather_condition_topic") + "\"><br>";
  html += "ota_hostname: <input name=\"disp_ota_hostname\" value=\"" + ctrl_get_display_cfg_cache("ota_hostname") + "\"><br>";
  html += "ota_password: <input name=\"disp_ota_password\" value=\"\"><br>";
  html += "espnow_channel: <input name=\"disp_espnow_channel\" value=\"" + ctrl_get_display_cfg_cache("espnow_channel") + "\"><br>";
  html += "espnow_peer_mac: <input name=\"disp_espnow_peer_mac\" value=\"" + ctrl_get_display_cfg_cache("espnow_peer_mac") + "\"><br>";
  html += "espnow_lmk: <input name=\"disp_espnow_lmk\" value=\"\"><br>";
  html += "controller_timeout_ms: <input name=\"disp_controller_timeout_ms\" value=\"" + ctrl_get_display_cfg_cache("controller_timeout_ms") + "\"><br>";
  html += "<button type=\"submit\">Save Display</button></form>";
  html += "<p>display_reboot_required=" + ctrl_get_display_cfg_cache("reboot_required") + "</p>";
  html += "<p>Use the display device IP + /screenshot for remote screen capture.</p>";
  html += "</body></html>";
  g_ctrl_web.send(200, "text/html", html);
}

void ctrl_ensure_web_ready() {
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }
  if (!g_ctrl_web_started) {
    g_ctrl_web.on("/", HTTP_GET, ctrl_web_handle_root);
    g_ctrl_web.on("/config", HTTP_GET, ctrl_web_handle_config_get);
    g_ctrl_web.on("/config", HTTP_POST, ctrl_web_handle_config_post);
    g_ctrl_web.begin();
    g_ctrl_web_started = true;
  }
  g_ctrl_web.handleClient();
}

